Тест1/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <comment>Дата договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <comment>Определяет валюту Расчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <comment>Дата начала действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <comment>Дата окончания действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.дт_ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйКонтрагента</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОрганизации</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОригинала</name>
    <type>
      <types>EnumRef.СтатусыДоговоровОригинал</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСкана</name>
    <type>
      <types>EnumRef.СтатусыДоговоровСкан</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/Enums/СтатусыДоговоровСкан/СтатусыДоговоровСкан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоговоровСкан</name>
  <enumValues>
    <name>СканПолучен</name>
  </enumValues>
  <enumValues>
    <name>СканОтправлен</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров</name>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ВладелецФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияДатаМодификацииФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияНомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	УстановитьНомерДоговора();
	//	СформироватьНаименованиеДоговора(ЭтаФорма);
	//КонецЕсли;
	УправлениеФормой(ЭтаФорма);
	
	///+ГомзяковаМА 20.02.2023
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОтветственныйМенеджер = Объект.Владелец.Ответственный;	
	КонецЕсли;
	///-ГомзяковаМА 20.02.2023
	
	/////+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	//ПоискСуществующихФайлов();
	/////-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	
	///+ГомзМА 15.06.2023
	Если НЕ ЗначениеЗаполнено(Объект.НомерДокументаПП) Тогда
		ПоследнийНомер = ПолучитьПоследнийНомерДокументаПоПорядку();
	
		Объект.НомерДокументаПП = ПоследнийНомер + 1;
	КонецЕсли;
	///-ГомзМА 15.06.2023
	
КонецПроцедуры

&НаСервере
Процедура ПоискСуществующихФайлов()

	///+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК ВладелецФайла,
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу,
	|	Файлы.Размер КАК Размер,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	СуществующиеФайлы = Запрос.Выполнить().Выгрузить();

	Если СуществующиеФайлы.Количество() > 0 Тогда
		Объект.СтатусСкана = Перечисления.СтатусыДоговоровСкан.СканПолучен;
	Иначе
		Объект.СтатусСкана = Неопределено;
	КонецЕсли;
	///-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.НомерДоговора) Тогда
		
		УстановитьНомерДоговора();
		СформироватьНаименованиеДоговора(ЭтаФорма);
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		СформироватьНаименованиеДоговора(ЭтаФорма);
		
	КонецЕсли;
	
	///+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	//ПоискСуществующихФайлов();
	///-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	///+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	//ПоискСуществующихФайлов();
	///-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьНомерДоговора();
	СформироватьНаименованиеДоговора(ЭтаФорма);
	
КонецПроцедуры



&НаКлиенте
Процедура ДатаДоговораПриИзменении(Элемент)
	
	УстановитьНомерДоговора();
	СформироватьНаименованиеДоговора(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	СформироватьНаименованиеДоговора(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьНомерДоговора()

	Если Объект.ТипДоговора <> ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыДоговора = Новый Структура("Ссылка, Организация, ДатаДоговора");	
	ЗаполнитьЗначенияСвойств(ПараметрыДоговора, Объект);
	

	//Объект.НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ПараметрыДоговора);
	///+ГомзМА 16.06.2023
	НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ПараметрыДоговора);
	Объект.НомерДоговора = "" + Формат(Объект.НомерДокументаПП, "ЧГ=0") + НомерДоговора;
	///-ГомзМА 16.06.2023
	

КонецПроцедуры // УстановитьНомерДоговора()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьНаименованиеДоговора(Форма)

	ПараметрыДоговора = Новый Структура("ДатаДоговора, НомерДоговора");	
	ЗаполнитьЗначенияСвойств(ПараметрыДоговора, Форма.Объект);
	
	Форма.Объект.Наименование = дт_ОбщегоНазначенияКлиентСервер.НаименованиеДоговора(ПараметрыДоговора);

КонецПроцедуры // СформироватьНаименованиеДоговора()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ВидДоговора.Видимость = Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем");

КонецПроцедуры // УправлениеФормой()

&НаСервере
Процедура СтатусОригиналаПриИзмененииНаСервере()
	
	/////+ГомзМА 17.02.2023 (Задача 000002747 от 16.02.2023)
	//Если Объект.СтатусОригинала = Перечисления.СтатусыДоговоровОригинал.ОтданЛичноВРуки Тогда
	//	Элементы.ГруппаКомуПереданДокумент.Видимость = Истина;
	//Иначе
	//	Элементы.ГруппаКомуПереданДокумент.Видимость = Ложь;
	//КонецЕсли;
	/////-ГомзМА 17.02.2023 (Задача 000002747 от 16.02.2023)
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОригиналаПриИзменении(Элемент)
	СтатусОригиналаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	
	///+ГомзяковаМА 20.02.2023
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОтветственныйМенеджер = Объект.Владелец.Ответственный;	
	КонецЕсли;
	///-ГомзяковаМА 20.02.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры


Функция ПолучитьПоследнийНомерДокументаПоПорядку()

	///+ГомзМА 15.06.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.НомерДокументаПП КАК НомерДокументаПП
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерДокументаПП УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.НомерДокументаПП;
	///-ГомзМА 15.06.2023

КонецФункции


#КонецОбласти
